InformationRegisters/Избранное.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>Избранное</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Публикация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Публикация</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/Публикация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Публикация</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Авторы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Каналы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСтатьи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/Избранное/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Элемент.ТекущиеДанные.Публикация)=Тип("ДокументСсылка.Публикация") Тогда
		ОткрытьФорму("Документ.Публикация.ФормаОбъекта", Новый Структура("Ключ", Элемент.ТекущиеДанные.Публикация));
	КонецЕсли;
КонецПроцедуры

Функция ТекстПолучить(Ссылка)
	Ответ = "";
	Если ТипЗнч(Ссылка) = Тип("РегистрСведенийКлючЗаписи.Избранное") Тогда
		Ответ = ТекстПолучить(Ссылка.Публикация);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Публикация") Тогда
		Ответ = ?(ПустаяСтрока(Ссылка.ТекстСтатьи), Ссылка.Описание, Ссылка.ТекстСтатьи);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ТекстУстановить(Текст="")
	Содержание.Удалить();
	Содержание.УстановитьHTML(Текст, Новый Структура);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Содержание.Вид = ВидПоляФормы.ПолеHTMLДокумента;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		Если Элементы.Содержание.Видимость Тогда
			Если Элемент.ТекущиеДанные = Неопределено Тогда
				Содержание.Удалить();
			ИначеЕсли НЕ Элемент.ТекущиеДанные.Свойство("Публикация") Тогда
				Содержание.Удалить();
			ИначеЕсли Найти(Содержание.ПолучитьТекст(), Лев(Элемент.ТекущиеДанные["Публикация.Описание"], 17)) = 0 Тогда
				ТекстУстановить(Инфостарт.Причесать(ТекстПолучить(Элемент.ТекущаяСтрока)));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
